In [9]:
import pandas as pd
import datetime as dt

# modify csv file putting column names in the first row
# note that integers cannot have coma separators (removed them by formating number differently)

#STEPS has been recorded in STEPS directory pay attention on the syntax in brackets 
steps=pd.read_csv(r'C:\Users\ciuqu\PYTHON\PYTHON-SCRIPTS\STEPS\steps_csv.csv')
steps

        Column1     Column2  Column3
0         Ali C  14/06/2020     2875
1     Annabelle  14/06/2020    11588
2       Chris C  14/06/2020    11402
3       Chris P  14/06/2020    14321
4         Elisa  14/06/2020     9747
...         ...         ...      ...
1764      Stacy  12/01/2021     8554
1765      Stacy  13/01/2021    14098
1766      Stacy  14/01/2021    11681
1767      Stacy  15/01/2021    14300
1768      Stacy  16/01/2021    12177

[1769 rows x 3 columns]

In [10]:
steps.columns
steps.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1769 entries, 0 to 1768
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  1769 non-null   object
 1   Column2  1769 non-null   object
 2   Column3  1769 non-null   int64
dtypes: int64(1), object(2)
memory usage: 41.6+ KB

In [11]:
# Change columns names

steps.rename(columns={'Column1':'PARTICIPANT', 'Column2':'DATE', 'Column3':'STEPS'}, inplace=True)

steps.head()

  PARTICIPANT        DATE  STEPS
0       Ali C  14/06/2020   2875
1   Annabelle  14/06/2020  11588
2     Chris C  14/06/2020  11402
3     Chris P  14/06/2020  14321
4       Elisa  14/06/2020   9747

In [13]:
# change 'DATE' column to datetime

steps['DATE']=pd.to_datetime(steps['DATE'])
steps.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1769 entries, 0 to 1768
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PARTICIPANT  1769 non-null   object
 1   DATE         1769 non-null   datetime64[ns]
 2   STEPS        1769 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 41.6+ KB

In [14]:
steps.head()

  PARTICIPANT       DATE  STEPS
0       Ali C 2020-06-14   2875
1   Annabelle 2020-06-14  11588
2     Chris C 2020-06-14  11402
3     Chris P 2020-06-14  14321
4       Elisa 2020-06-14   9747

In [15]:
# df['wkd'] = df['Timestamp'].dt.dayofweek
steps['wkd']= steps['DATE'].dt.dayofweek
steps

     PARTICIPANT       DATE  STEPS  wkd
0          Ali C 2020-06-14   2875    6
1      Annabelle 2020-06-14  11588    6
2        Chris C 2020-06-14  11402    6
3        Chris P 2020-06-14  14321    6
4          Elisa 2020-06-14   9747    6
...          ...        ...    ...  ...
1764       Stacy 2021-12-01   8554    2
1765       Stacy 2021-01-13  14098    2
1766       Stacy 2021-01-14  11681    3
1767       Stacy 2021-01-15  14300    4
1768       Stacy 2021-01-16  12177    5

[1769 rows x 4 columns]

In [16]:
# Participants mean weekday steps = pmwds

pmwds=steps['STEPS'].groupby([steps['PARTICIPANT'], steps['wkd']]).mean()

# print the grouped data

print(pmwds)

PARTICIPANT  wkd
Ali C        0       4868.000000
             1       6868.000000
             2       3620.000000
             3       3075.000000
             4       5620.000000
                        ...
Vicky        2      11263.000000
             3      12890.333333
             4       7792.500000
             5       7596.000000
             6       5055.333333
Name: STEPS, Length: 132, dtype: float64

In [17]:
# Printing an entire DataFrame results in every row and column of the DataFrame being printed.

pd.set_option("display.max_rows", None, "display.max_columns", None)

print(pmwds)

PARTICIPANT  wkd
Ali C        0       4868.000000
             1       6868.000000
             2       3620.000000
             3       3075.000000
             4       5620.000000
             5       2768.000000
             6       2875.000000
Ally W       0      12917.290323
             1      11173.741935
             2      11953.600000
             3      12051.133333
             4      13422.133333
             5      13839.965517
             6      13809.413793
Annabelle    0       9369.750000
             1       5542.333333
             2       3687.333333
             3      11384.333333
             4       3483.000000
             5       4459.500000
             6       9521.750000
Annabelle    0       2516.500000
             1      14940.000000
             2        425.000000
             4        519.000000
             5      10352.000000
             6       5472.000000
Chris C      0      12237.093750
             1      12655.193548
             2      11666.750000
             3      10644.375000
             4      13106.806452
             5      12835.900000
             6      12401.448276
Chris P      0      13201.156250
             1      13501.677419
             2      12143.218750
             3      13222.870968
             4      13287.387097
             5      15602.300000
             6      13271.166667
Elisa        0       9486.333333
             1       5782.500000
             2      13315.000000
             3       7827.000000
             4       8991.500000
             5       7937.500000
             6       7433.666667
Lauren       0      11094.500000
             1      10849.090909
             2      14049.416667
             3      10756.250000
             4      13062.000000
             5      12982.461538
             6      10683.916667
Lili         0       9181.454545
             1       8764.090909
             2       8158.375000
             3       8840.727273
             4       6786.086957
             5       6107.200000
             6       9970.666667
Lynda        0       2713.714286
             1       3461.714286
             2       3759.333333
             3       3715.750000
             4       4048.833333
             5       1838.500000
             6       1864.800000
Lyndsay      0       8494.250000
             1       9793.666667
             2       8398.200000
             3       6025.800000
             4       6511.250000
             5       5681.800000
             6      11246.000000
Nat          0      13089.666667
             1       6782.181818
             2       8997.111111
             3       9216.250000
             4       6998.125000
             5      11807.875000
             6      11856.000000
Pete C       0       3703.571429
             1       3198.428571
             2       3879.166667
             3       4151.833333
             4       3910.714286
             5       4202.000000
             6       4777.500000
Pete R       0       4494.500000
             1       7650.857143
             2       6426.250000
             3       4153.400000
             4       4589.500000
             5       4538.166667
             6      11097.750000
Rachel       0      13525.000000
             1       8417.200000
             2       4569.500000
             3      10160.000000
             4      11280.000000
             5       6731.000000
             6       7084.333333
Sarah        0       8159.285714
             1       8651.833333
             2      10212.437500
             3       8141.307692
             4       8481.533333
             5       8010.454545
             6       7980.875000
Stacy        0      14236.937500
             1      12784.548387
             2      12230.812500
             3      13194.290323
             4      12021.096774
             5      12158.800000
             6      11902.466667
Tricia       0       7676.548387
             1       7648.580645
             2       8451.033333
             3       8496.766667
             4       9314.482759
             5       9918.379310
             6       8409.866667
Vicky        0       7503.000000
             1      15775.166667
             2      11263.000000
             3      12890.333333
             4       7792.500000
             5       7596.000000
             6       5055.333333
Name: STEPS, dtype: float64

In [43]:
# Competition participants mean weakday steps

competitors= ['Lili','Stacy','Tricia', 'Lauren', 'Chris P', 'Chris C', 'Ally W']
print("Lili's weakest weekday:")
print(pmwds['Lili'].min()) 
print ('steps')

Lili's weakest weekday:
6107.2
steps

TypeError: unsupported operand type(s) for +: 'NoneType' and 'NoneType'